In [ ]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [1]:
df

NameError: name 'df' is not defined

In [2]:
df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

NameError: name 'pd' is not defined

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [6]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [7]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [8]:
df.loc[2:4, ['name', 'age']]

    name  age
2  peter   22
3   jeff   19
4   bill   45

In [9]:
df.iloc[:2]

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [10]:
df.iloc[-2:]

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [12]:
df.loc[:2]

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0

In [14]:
df[df['age']>30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [15]:
df[df['age']<30]

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
2  peter   22  california             0         0
3   jeff   19       texas             1         5

In [16]:
df[df.age<30]

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
2  peter   22  california             0         0
3   jeff   19       texas             1         5

In [17]:
df[df.age>40 & df.num_pets > 1]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [18]:
df[(df.age>40) & (df.num_pets > 1)]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [19]:
df[(df.age>40) & (df.num_pets > 0)]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [25]:
df[(df.age>40) | (df.num_pets !=0)]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
3  jeff   19       texas             1         5
4  bill   45  washington             2         0

In [26]:
len(df[(df.age>40) & (df.num_pets > 0)])

1

In [22]:
len(df)

6

In [24]:
df.drop([2], axis=0)

   name  age       state  num_children  num_pets
0  john   23        iowa             2         0
1  mary   78          dc             2         4
3  jeff   19       texas             1         5
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [27]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [28]:
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

In [29]:
df_dropped = df.drop(["age", "num_children"], axis=1)

In [30]:
df_dropped

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [31]:
df_dropped.describe()

       num_pets
count  6.000000
mean   1.500000
std    2.345208
min    0.000000
25%    0.000000
50%    0.000000
75%    3.000000
max    5.000000

In [32]:
df.age.mean()

36.666666666666664

In [33]:
df.num_children.mean()

1.3333333333333333

In [34]:
df.num_pets.mean()

1.5

In [35]:
df[['age', 'num_pets', 'num_children']].mean()

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [37]:
import numpy

df[['age', 'num_pets', 'num_children']].apply(lambda col: numpy.mean(col), axis=0)

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [38]:
df[['age', 'num_pets', 'num_children']].sum()

age             220
num_pets          9
num_children      8
dtype: int64

In [39]:
df[['female']].mean()

KeyError: "None of [Index(['female'], dtype='object')] are in the [columns]"

In [40]:
df = pd.read_csv('titanic.csv')

FileNotFoundError: [Errno 2] File b'titanic.csv' does not exist: b'titanic.csv'